{"class_name": "Model", "keras_version": "2.0.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 94, 94, 94], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "valid", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv3d_1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv3d_1", 0, 0, {}]]], "name": "batch_normalization_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "activation_1"}, {"class_name": "MaxPooling3D", "config": {"name": "max_pooling3d_1", "trainable": true, "data_format": "channels_first", "pool_size": [2, 2, 2], "padding": "valid", "strides": [2, 2, 2]}, "inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "max_pooling3d_1"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "valid", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "inbound_nodes": [[["max_pooling3d_1", 0, 0, {}]]], "name": "conv3d_2"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv3d_2", 0, 0, {}]]], "name": "batch_normalization_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "activation_2"}, {"class_name": "MaxPooling3D", "config": {"name": "max_pooling3d_2", "trainable": true, "data_format": "channels_first", "pool_size": [2, 2, 2], "padding": "valid", "strides": [2, 2, 2]}, "inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "max_pooling3d_2"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_3", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "valid", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "inbound_nodes": [[["max_pooling3d_2", 0, 0, {}]]], "name": "conv3d_3"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv3d_3", 0, 0, {}]]], "name": "batch_normalization_3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "name": "activation_3"}, {"class_name": "MaxPooling3D", "config": {"name": "max_pooling3d_3", "trainable": true, "data_format": "channels_first", "pool_size": [2, 2, 2], "padding": "valid", "strides": [2, 2, 2]}, "inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "max_pooling3d_3"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_4", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "valid", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "inbound_nodes": [[["max_pooling3d_3", 0, 0, {}]]], "name": "conv3d_4"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv3d_4", 0, 0, {}]]], "name": "batch_normalization_4"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "name": "activation_4"}, {"class_name": "UpSampling3D", "config": {"trainable": true, "data_format": "channels_first", "name": "up_sampling3d_1", "size": [2, 2, 2]}, "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "up_sampling3d_1"}, {"class_name": "Cropping3D", "config": {"cropping": [[2, 2], [2, 2], [2, 2]], "trainable": true, "name": "cropping3d_1", "data_format": "channels_first"}, "inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "cropping3d_1"}, {"class_name": "Merge", "config": {"name": "merge_1", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["up_sampling3d_1", 0, 0, {"mask": [null, null]}], ["cropping3d_1", 0, 0, {"mask": [null, null]}]]], "name": "merge_1"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_5", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "valid", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "inbound_nodes": [[["merge_1", 0, 0, {}]]], "name": "conv3d_5"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv3d_5", 0, 0, {}]]], "name": "batch_normalization_5"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "name": "activation_5"}, {"class_name": "UpSampling3D", "config": {"trainable": true, "data_format": "channels_first", "name": "up_sampling3d_2", "size": [2, 2, 2]}, "inbound_nodes": [[["activation_5", 0, 0, {}]]], "name": "up_sampling3d_2"}, {"class_name": "Cropping3D", "config": {"cropping": [[8, 8], [8, 8], [8, 8]], "trainable": true, "name": "cropping3d_2", "data_format": "channels_first"}, "inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "cropping3d_2"}, {"class_name": "Merge", "config": {"name": "merge_2", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["up_sampling3d_2", 0, 0, {"mask": [null, null]}], ["cropping3d_2", 0, 0, {"mask": [null, null]}]]], "name": "merge_2"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_6", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "valid", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "inbound_nodes": [[["merge_2", 0, 0, {}]]], "name": "conv3d_6"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_6", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv3d_6", 0, 0, {}]]], "name": "batch_normalization_6"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "name": "activation_6"}, {"class_name": "UpSampling3D", "config": {"trainable": true, "data_format": "channels_first", "name": "up_sampling3d_3", "size": [2, 2, 2]}, "inbound_nodes": [[["activation_6", 0, 0, {}]]], "name": "up_sampling3d_3"}, {"class_name": "Cropping3D", "config": {"cropping": [[20, 20], [20, 20], [20, 20]], "trainable": true, "name": "cropping3d_3", "data_format": "channels_first"}, "inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "cropping3d_3"}, {"class_name": "Merge", "config": {"name": "merge_3", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["up_sampling3d_3", 0, 0, {"mask": [null, null]}], ["cropping3d_3", 0, 0, {"mask": [null, null]}]]], "name": "merge_3"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_7", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "valid", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "inbound_nodes": [[["merge_3", 0, 0, {}]]], "name": "conv3d_7"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_7", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv3d_7", 0, 0, {}]]], "name": "batch_normalization_7"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "name": "activation_7"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_8", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_first", "padding": "valid", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "inbound_nodes": [[["activation_7", 0, 0, {}]]], "name": "conv3d_8"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "conv3d_9", "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "data_format": "channels_first", "padding": "valid", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 50, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1, 1]}, "inbound_nodes": [[["conv3d_8", 0, 0, {}]]], "name": "conv3d_9"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["conv3d_9", 0, 0]], "name": "model_1"}, "backend": "tensorflow"}